/*******************************************************************************
* Copyright (C), 2020, Lenkor Tech. Co., Ltd. All rights reserved.
* 文件说明 : 文档类标识
* 功能描述 : NetCan接口类
* 创 建 人 : panjun        20200120
* 审 核 人 : binchaolin
* 文件版本 : V1.00
* 修订记录 : 版本      修订人      修订日期      修订内容
*
*
*******************************************************************************/

#pragma once

#include "DemoNetLayer.h"
#include "StdInclude.h"
#include "Binary.h"
namespace Topdon_AD900_Demo {
	class CNetCan : public CNetLayer
	{
	public:
		CNetCan();
		~CNetCan();

		/*-----------------------------------------------------------------------------
		功    能：初始化
		参数说明：sfSendCmd 请求命令
		返 回 值：CRecvFrame 应答命令
		说    明：无
		-----------------------------------------------------------------------------*/
		CRecvFrame Init(CSendFrame sfSendCmd);

		/*-----------------------------------------------------------------------------
		功    能：发送接收命令
		参数说明：sfSendCmd 请求命令
		返 回 值：CReceiveFrame 应答命令
		说    明：无
		-----------------------------------------------------------------------------*/
		//CRecvFrame SendReceive(CSendFrame sfSendCmd);

	// 	/*-----------------------------------------------------------------------------
	// 	功    能：发送接收命令，接受多帧
	// 	参数说明：SendCmd 请求命令
	// 	返 回 值：CReceiveFrame 应答命令
	// 	说    明：无
	// 	-----------------------------------------------------------------------------*/
	// 	CMultiRecvFrame SendReceiveMulti(CMultiSendFrame mulsfSendCmd);

		/*-----------------------------------------------------------------------------
		功    能：打包命令
		参数说明：sfSendCmd 发送命令
		返 回 值：CSendFrame 打包后的命令
		说    明：无
		-----------------------------------------------------------------------------*/
		CSendFrame    Pack(CSendFrame sfSendCmd);

		/*-----------------------------------------------------------------------------
		功    能：解包命令
		参数说明：rfRecv 回复数据
		返 回 值：CReceiveFrame 解包后的数据
		说    明：无
		-----------------------------------------------------------------------------*/
		CRecvFrame UnPack(CRecvFrame rfRecv);

		/*-----------------------------------------------------------------------------
		功    能：重设过滤器
		参数说明：无
		返 回 值：ErrorCode_t 错误类型
		说    明：无
		-----------------------------------------------------------------------------*/
		ErrorCode_t ResetFilter();

		/*-----------------------------------------------------------------------------
		功    能：按ID设置过滤器
		参数说明：uFilterID 过滤ID
		返 回 值：ErrorCode_t 错误类型
		说    明：无
		-----------------------------------------------------------------------------*/
		ErrorCode_t SetFilterId(uint32_t uFilterID);


		/*-----------------------------------------------------------------------------
		功    能：按ID设置过滤器
		参数说明：binFilterId 过滤ID
		返 回 值：ErrorCode_t 错误类型
		说    明：无
		-----------------------------------------------------------------------------*/
		ErrorCode_t SetFilterId(CBinary binFilterId);

		/*-----------------------------------------------------------------------------
		功    能：根据类型进行过滤
		参数说明：bgFilterId 为过滤ID的集合，规则如下：
							  uFilterType为过滤类型，FT_ByID，FT_ByMask，FT_ByRange
							  FT_ByID时,bgFilterId[0]为000007E0,单个存在
							  FT_ByMask时,bgFilterId[0]为FFFFFF00,bgFilterId[1]为18DA11F1,1是掩码，2是过滤ID，且ID长度一致,成对存在
							  FT_ByRange时,bgFilterId[0]为18F11000,bgFilterId[1]为18F11A00, 1是起始ID，2是结束ID，且ID长度一致,成对存在
							  多组ID同时过滤
		返 回 值：ErrorCode_t 错误类型
		说    明：无
		-----------------------------------------------------------------------------*/
		ErrorCode_t SetFilterId(uint8_t uFilterType, CBinaryGroup bgFilterId);

		/*-----------------------------------------------------------------------------
		功    能：	设置流控制帧类型
		参数说明：	uFlowCtrlMode 流控制类型
		uFlowCtrlTime 流控制帧时间
		uFlowCtrlBlockSize 流控制帧块大小
		返 回 值：	ErrorCode_t 错误类型
		说    明：	无
		-----------------------------------------------------------------------------*/
		ErrorCode_t SetFlowCtrlType(uint8_t uFlowCtrlMode = (uint8_t)CStdCommMaco::FlowCtrlType::FCT_AUTO, uint32_t uFlowCtrlTime = (1 << 31), uint32_t uFlowCtrlBlockSize = (1 << 31));

		/*-----------------------------------------------------------------------------
		功    能：设置填充位字节
		参数说明：ucFillByte 填充位字节
		返 回 值：ErrorCode_t 错误类型
		说    明：无
		-----------------------------------------------------------------------------*/
		ErrorCode_t SetCanFillByte(uint8_t ucFillByte);

		/*-----------------------------------------------------------------------------
		功    能：设置Can的扩展地址
		参数说明：bTargetId 目标地址
				  bSourceId 源地址
		返 回 值：ErrorCode_t 错误类型
		说    明：无
		-----------------------------------------------------------------------------*/
		ErrorCode_t SetCanExtendedId(uint8_t bTargetId, uint8_t bSourceId);

		/*-----------------------------------------------------------------------------
		功    能：设置帧格式类型中打包需要的ToolId
		参数说明：uTooID CANID
		返 回 值：无
		说    明：无
		-----------------------------------------------------------------------------*/
		void SetToolId(uint32_t uTooID);

		/*-----------------------------------------------------------------------------
		功    能：设置帧格式类型中打包需要的ToolId
		参数说明：uTooID CANID
		返 回 值：无
		说    明：无
		-----------------------------------------------------------------------------*/
		ErrorCode_t SetSingleCanFormatId(uint32_t RxCanId, uint32_t TxCanId = 0, bool SetFlag = true);


	protected:

	};
}