#ifndef _DEMO_H_
#define _DEMO_H_
#include "StdInclude.h"
#include "DemoVehicleStruct.h"
#include "DataFile.h"
#include "ArtiGlobal.h"

namespace Topdon_AD900_Demo {

	class CDemo
	{
	public:
		CDemo();
		~CDemo();

	public:
		/*-----------------------------------------------------------------------------
		功    能：选择诊断类型	Select diagnostic type
		参数说明：无
		返 回 值： 
		说    明：
				标题：选择诊断类型 Select diagnostic type
				菜单1.自动选择车型	Automatic	-》 Automatic_Selection()
				菜单2.手动选择车型	Manual		-》 Manual_Selection()
				菜单3.选择系统		System		-》 System_Selection()
		-----------------------------------------------------------------------------*/
		int32_t MainEntry();

		/*-----------------------------------------------------------------------------
		功    能：自动选择车型
		参数说明：无
		返 回 值：无
		说    明：
				执行逻辑：
					1.读取VIN
					2.解析VIN
		-----------------------------------------------------------------------------*/
		void Automatic_Selection();

		/*-----------------------------------------------------------------------------
		功    能：手动选择车型
		参数说明：无
		返 回 值：
		说    明：
				执行逻辑：
				1.选择区域
				2.选择年款
				3.选择车型
				4.选择主菜单 Main menu	-》 ShowMainMenu()
					4.1.诊断 Diagnosis	-》 CAppLayer::StartAppLayer()
					4.2.常用特殊功能	-》 CHotFunction::ShowMainMenu()

		-----------------------------------------------------------------------------*/
		void Manual_Selection();

		/*-----------------------------------------------------------------------------
		功    能：显示主菜单
		参数说明：无
		返 回 值：无
		说    明：无
				标题：主菜单 Main menu
				菜单1：诊断 Diagnosis	-》 CAppLayer::StartAppLayer()
				菜单2：常用特殊功能		-》 CHotFunction::ShowMainMenu()
		-----------------------------------------------------------------------------*/
		void ShowMainMenu();

		/*-----------------------------------------------------------------------------
		功    能：将历史记录设给APP
		参数说明：无
		返 回 值：无
		说    明：无
		-----------------------------------------------------------------------------*/
		void	SetMyHistory();

		/*-----------------------------------------------------------------------------
		功    能：选择诊断类型  诊断  保养
		参数说明：无
		返 回 值：无
		说    明：无
		-----------------------------------------------------------------------------*/
		void	SelectDiagType();

		/*-----------------------------------------------------------------------------
		功    能：切换车型品牌
		参数说明：无
		返 回 值：无
		说    明：无
		-----------------------------------------------------------------------------*/
		void	ChangeVechile();

	public:
	 static	CModelInfo m_ModelInfo;
	 map<uint32_t, string> mapeDiagEntryType;

	};
}

#endif
