/*******************************************************************************
* Copyright (C), 2020, Lenkor Tech. Co., Ltd. All rights reserved.
* 文件说明 : 文档类标识
* 功能描述 : 帧校验类，用于处里收/发帧的校验
* 创 建 人 : sujiya        20201103
* 审 核 人 : binchaolin    20201202
* 文件版本 : V1.00
* 修订记录 : 版本      修订人      修订日期      修订内容
*
*
*******************************************************************************/
#ifndef _FRAME_CS_H_
#define _FRAME_CS_H_
#include "SendFrame.h"
#include "StdCommMaco.h"

class _STD_DLL_API_ CFrameCs
{
public:
	CFrameCs(CStdCommMaco::FrameCsType uCsType = CStdCommMaco::FrameCsType::CS_NONE) :m_uCsType(uCsType) {}
	~CFrameCs() {}


	/**********************************************************
	*    功  能：设置校验类型
	*    参  数：uCsType 当前收/发帧的校验类型
	*    返回值：无
	**********************************************************/
	void SetCsType(CStdCommMaco::FrameCsType uCsType) { m_uCsType = uCsType; }

	/**********************************************************
	*    功  能：获取当前的校验类型
	*    参  数：无
	*    返回值：返回当前校验类型
	**********************************************************/
	CStdCommMaco::FrameCsType GetCsType()const { return m_uCsType; }

	/**********************************************************
	*    功  能：追加校验字节到数据的末尾
	*    参  数：需要追加校验字节的数据对象
	*    返回值：追加校验字节后的数据对象
	**********************************************************/
	CBinary& AppendCs(CBinary& right);

	/**********************************************************
	*    功  能：清除校验字节
	*    参  数：需要清除校验字节的数据对象
	*    返回值：清除校验字节后的数据对象
	**********************************************************/
	CBinary& EraseCs(CBinary& right);

	/**********************************************************
	*    功  能：重置校验字节
	*    参  数：需要重置校验字节的数据对象
	*    返回值：重置校验字节后的数据对象
	**********************************************************/
	CBinary& ResetCs(CBinary& right);

	/**********************************************************
	*    功  能：追加校验字节到发送帧的末尾
	*    参  数：需要追加校验字节的发送帧对象
	*    返回值：追加校验字节后的发送帧对象
	**********************************************************/
	CSendFrame& AppendCs(CSendFrame& right);

	/**********************************************************
	*    功  能：清除发送帧的校验字节
	*    参  数：需要清除校验字节的发送帧对象
	*    返回值：清除校验字节后的发送帧对象
	**********************************************************/
	CSendFrame& EraseCs(CSendFrame& right);

	/**********************************************************
	*    功  能：重置发送帧的校验字节
	*    参  数：需要重置校验字节的发送帧对象
	*    返回值：重置校验字节后的发送帧对象
	**********************************************************/
	CSendFrame& ResetCs(CSendFrame& right);

protected:
	uint8_t Calc_Crc8(const CBinary& right);
	uint16_t Calc_Crc16(const CBinary& right);

private:
	CStdCommMaco::FrameCsType m_uCsType;
};


#endif

